espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_nvic.h
/******************************************************************************
*  Filename:       hw_cpu_nvic_h
*  Revised:        $Date$
*  Revision:       $Revision$
*
* Copyright (c) 2015 - 2017, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_CPU_NVIC_H__
#define __HW_CPU_NVIC_H__

//*****************************************************************************
//
// This section defines the register offsets of
// CPU_NVIC component
//
//*****************************************************************************
// Enables or reads the enabled state of each group of 32 interrupts
#define CPU_NVIC_O_ISER0                                            0x00000000

// Enables or reads the enabled state of each group of 32 interrupts
#define CPU_NVIC_O_ISER1                                            0x00000004

// Enables or reads the enabled state of each group of 32 interrupts
#define CPU_NVIC_O_ISER2                                            0x00000008

// Clears or reads the enabled state of each group of 32 interrupts
#define CPU_NVIC_O_ICER0                                            0x00000080

// Clears or reads the enabled state of each group of 32 interrupts
#define CPU_NVIC_O_ICER1                                            0x00000084

// Clears or reads the enabled state of each group of 32 interrupts
#define CPU_NVIC_O_ICER2                                            0x00000088

// Enables or reads the pending state of each group of 32 interrupts
#define CPU_NVIC_O_ISPR0                                            0x00000100

// Enables or reads the pending state of each group of 32 interrupts
#define CPU_NVIC_O_ISPR1                                            0x00000104

// Enables or reads the pending state of each group of 32 interrupts
#define CPU_NVIC_O_ISPR2                                            0x00000108

// Clears or reads the pending state of each group of 32 interrupts
#define CPU_NVIC_O_ICPR0                                            0x00000180

// Clears or reads the pending state of each group of 32 interrupts
#define CPU_NVIC_O_ICPR1                                            0x00000184

// Clears or reads the pending state of each group of 32 interrupts
#define CPU_NVIC_O_ICPR2                                            0x00000188

// For each group of 32 interrupts, shows the active state of each interrupt
#define CPU_NVIC_O_IABR0                                            0x00000200

// For each group of 32 interrupts, shows the active state of each interrupt
#define CPU_NVIC_O_IABR1                                            0x00000204

// For each group of 32 interrupts, shows the active state of each interrupt
#define CPU_NVIC_O_IABR2                                            0x00000208

// For each group of 32 interrupts, determines whether each interrupt targets
// Non-secure or Secure state
#define CPU_NVIC_O_ITNS0                                            0x00000280

// For each group of 32 interrupts, determines whether each interrupt targets
// Non-secure or Secure state
#define CPU_NVIC_O_ITNS1                                            0x00000284

// For each group of 32 interrupts, determines whether each interrupt targets
// Non-secure or Secure state
#define CPU_NVIC_O_ITNS2                                            0x00000288

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR0                                             0x00000300

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR1                                             0x00000304

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR2                                             0x00000308

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR3                                             0x0000030C

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR4                                             0x00000310

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR5                                             0x00000314

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR6                                             0x00000318

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR7                                             0x0000031C

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR8                                             0x00000320

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR9                                             0x00000324

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR10                                            0x00000328

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR11                                            0x0000032C

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR12                                            0x00000330

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR13                                            0x00000334

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR14                                            0x00000338

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR15                                            0x0000033C

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR16                                            0x00000340

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR17                                            0x00000344

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR18                                            0x00000348

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR19                                            0x0000034C

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR20                                            0x00000350

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR21                                            0x00000354

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR22                                            0x00000358

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR23                                            0x0000035C

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR24                                            0x00000360

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR25                                            0x00000364

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR26                                            0x00000368

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR27                                            0x0000036C

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR28                                            0x00000370

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR29                                            0x00000374

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR30                                            0x00000378

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR31                                            0x0000037C

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR32                                            0x00000380

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR33                                            0x00000384

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR34                                            0x00000388

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR35                                            0x0000038C

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR36                                            0x00000390

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR37                                            0x00000394

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR38                                            0x00000398

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR39                                            0x0000039C

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR40                                            0x000003A0

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR41                                            0x000003A4

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR42                                            0x000003A8

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR43                                            0x000003AC

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR44                                            0x000003B0

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR45                                            0x000003B4

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR46                                            0x000003B8

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR47                                            0x000003BC

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR48                                            0x000003C0

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR49                                            0x000003C4

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR50                                            0x000003C8

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR51                                            0x000003CC

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR52                                            0x000003D0

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR53                                            0x000003D4

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR54                                            0x000003D8

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR55                                            0x000003DC

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR56                                            0x000003E0

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR57                                            0x000003E4

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR58                                            0x000003E8

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR59                                            0x000003EC

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR60                                            0x000003F0

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR61                                            0x000003F4

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR62                                            0x000003F8

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR63                                            0x000003FC

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR64                                            0x00000400

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR65                                            0x00000404

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR66                                            0x00000408

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR67                                            0x0000040C

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR68                                            0x00000410

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR69                                            0x00000414

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR70                                            0x00000418

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR71                                            0x0000041C

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR72                                            0x00000420

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR73                                            0x00000424

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR74                                            0x00000428

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR75                                            0x0000042C

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR76                                            0x00000430

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR77                                            0x00000434

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR78                                            0x00000438

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR79                                            0x0000043C

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR80                                            0x00000440

// Sets or reads interrupt priorities
#define CPU_NVIC_O_IPR81                                            0x00000444

//*****************************************************************************
//
// Register: CPU_NVIC_O_ISER0
//
//*****************************************************************************
// Field:  [31:0] SETENA
//
// For SETENA[m] in NVIC_ISER*n, indicates whether interrupt 32*n + m is
// enabled
#define CPU_NVIC_ISER0_SETENA_W                                             32
#define CPU_NVIC_ISER0_SETENA_M                                     0xFFFFFFFF
#define CPU_NVIC_ISER0_SETENA_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_ISER1
//
//*****************************************************************************
// Field:  [31:0] SETENA
//
// For SETENA[m] in NVIC_ISER*n, indicates whether interrupt 32*n + m is
// enabled
#define CPU_NVIC_ISER1_SETENA_W                                             32
#define CPU_NVIC_ISER1_SETENA_M                                     0xFFFFFFFF
#define CPU_NVIC_ISER1_SETENA_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_ISER2
//
//*****************************************************************************
// Field:  [31:0] SETENA
//
// For SETENA[m] in NVIC_ISER*n, indicates whether interrupt 32*n + m is
// enabled
#define CPU_NVIC_ISER2_SETENA_W                                             32
#define CPU_NVIC_ISER2_SETENA_M                                     0xFFFFFFFF
#define CPU_NVIC_ISER2_SETENA_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_ICER0
//
//*****************************************************************************
// Field:  [31:0] CLRENA
//
// For CLRENA[m] in NVIC_ICER*n, indicates whether interrupt 32*n + m is
// enabled
#define CPU_NVIC_ICER0_CLRENA_W                                             32
#define CPU_NVIC_ICER0_CLRENA_M                                     0xFFFFFFFF
#define CPU_NVIC_ICER0_CLRENA_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_ICER1
//
//*****************************************************************************
// Field:  [31:0] CLRENA
//
// For CLRENA[m] in NVIC_ICER*n, indicates whether interrupt 32*n + m is
// enabled
#define CPU_NVIC_ICER1_CLRENA_W                                             32
#define CPU_NVIC_ICER1_CLRENA_M                                     0xFFFFFFFF
#define CPU_NVIC_ICER1_CLRENA_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_ICER2
//
//*****************************************************************************
// Field:  [31:0] CLRENA
//
// For CLRENA[m] in NVIC_ICER*n, indicates whether interrupt 32*n + m is
// enabled
#define CPU_NVIC_ICER2_CLRENA_W                                             32
#define CPU_NVIC_ICER2_CLRENA_M                                     0xFFFFFFFF
#define CPU_NVIC_ICER2_CLRENA_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_ISPR0
//
//*****************************************************************************
// Field:  [31:0] SETPEND
//
// For SETPEND[m] in NVIC_ISPR*n, indicates whether interrupt 32*n + m is
// pending
#define CPU_NVIC_ISPR0_SETPEND_W                                            32
#define CPU_NVIC_ISPR0_SETPEND_M                                    0xFFFFFFFF
#define CPU_NVIC_ISPR0_SETPEND_S                                             0

//*****************************************************************************
//
// Register: CPU_NVIC_O_ISPR1
//
//*****************************************************************************
// Field:  [31:0] SETPEND
//
// For SETPEND[m] in NVIC_ISPR*n, indicates whether interrupt 32*n + m is
// pending
#define CPU_NVIC_ISPR1_SETPEND_W                                            32
#define CPU_NVIC_ISPR1_SETPEND_M                                    0xFFFFFFFF
#define CPU_NVIC_ISPR1_SETPEND_S                                             0

//*****************************************************************************
//
// Register: CPU_NVIC_O_ISPR2
//
//*****************************************************************************
// Field:  [31:0] SETPEND
//
// For SETPEND[m] in NVIC_ISPR*n, indicates whether interrupt 32*n + m is
// pending
#define CPU_NVIC_ISPR2_SETPEND_W                                            32
#define CPU_NVIC_ISPR2_SETPEND_M                                    0xFFFFFFFF
#define CPU_NVIC_ISPR2_SETPEND_S                                             0

//*****************************************************************************
//
// Register: CPU_NVIC_O_ICPR0
//
//*****************************************************************************
// Field:  [31:0] CLRPEND
//
// For CLRPEND[m] in NVIC_ICPR*n, indicates whether interrupt 32*n + m is
// pending
#define CPU_NVIC_ICPR0_CLRPEND_W                                            32
#define CPU_NVIC_ICPR0_CLRPEND_M                                    0xFFFFFFFF
#define CPU_NVIC_ICPR0_CLRPEND_S                                             0

//*****************************************************************************
//
// Register: CPU_NVIC_O_ICPR1
//
//*****************************************************************************
// Field:  [31:0] CLRPEND
//
// For CLRPEND[m] in NVIC_ICPR*n, indicates whether interrupt 32*n + m is
// pending
#define CPU_NVIC_ICPR1_CLRPEND_W                                            32
#define CPU_NVIC_ICPR1_CLRPEND_M                                    0xFFFFFFFF
#define CPU_NVIC_ICPR1_CLRPEND_S                                             0

//*****************************************************************************
//
// Register: CPU_NVIC_O_ICPR2
//
//*****************************************************************************
// Field:  [31:0] CLRPEND
//
// For CLRPEND[m] in NVIC_ICPR*n, indicates whether interrupt 32*n + m is
// pending
#define CPU_NVIC_ICPR2_CLRPEND_W                                            32
#define CPU_NVIC_ICPR2_CLRPEND_M                                    0xFFFFFFFF
#define CPU_NVIC_ICPR2_CLRPEND_S                                             0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IABR0
//
//*****************************************************************************
// Field:  [31:0] ACTIVE
//
// For ACTIVE[m] in NVIC_IABR*n, indicates the active state for interrupt
// 32*n+m
#define CPU_NVIC_IABR0_ACTIVE_W                                             32
#define CPU_NVIC_IABR0_ACTIVE_M                                     0xFFFFFFFF
#define CPU_NVIC_IABR0_ACTIVE_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IABR1
//
//*****************************************************************************
// Field:  [31:0] ACTIVE
//
// For ACTIVE[m] in NVIC_IABR*n, indicates the active state for interrupt
// 32*n+m
#define CPU_NVIC_IABR1_ACTIVE_W                                             32
#define CPU_NVIC_IABR1_ACTIVE_M                                     0xFFFFFFFF
#define CPU_NVIC_IABR1_ACTIVE_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IABR2
//
//*****************************************************************************
// Field:  [31:0] ACTIVE
//
// For ACTIVE[m] in NVIC_IABR*n, indicates the active state for interrupt
// 32*n+m
#define CPU_NVIC_IABR2_ACTIVE_W                                             32
#define CPU_NVIC_IABR2_ACTIVE_M                                     0xFFFFFFFF
#define CPU_NVIC_IABR2_ACTIVE_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_ITNS0
//
//*****************************************************************************
// Field:  [31:0] ITNS
//
// For ITNS[m] in NVIC_ITNS*n, `IAAMO the target Security state for interrupt
// 32*n+m
#define CPU_NVIC_ITNS0_ITNS_W                                               32
#define CPU_NVIC_ITNS0_ITNS_M                                       0xFFFFFFFF
#define CPU_NVIC_ITNS0_ITNS_S                                                0

