espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_nvic.h
//*****************************************************************************
//
// Register: CPU_NVIC_O_ITNS1
//
//*****************************************************************************
// Field:  [31:0] ITNS
//
// For ITNS[m] in NVIC_ITNS*n, `IAAMO the target Security state for interrupt
// 32*n+m
#define CPU_NVIC_ITNS1_ITNS_W                                               32
#define CPU_NVIC_ITNS1_ITNS_M                                       0xFFFFFFFF
#define CPU_NVIC_ITNS1_ITNS_S                                                0

//*****************************************************************************
//
// Register: CPU_NVIC_O_ITNS2
//
//*****************************************************************************
// Field:  [31:0] ITNS
//
// For ITNS[m] in NVIC_ITNS*n, `IAAMO the target Security state for interrupt
// 32*n+m
#define CPU_NVIC_ITNS2_ITNS_W                                               32
#define CPU_NVIC_ITNS2_ITNS_M                                       0xFFFFFFFF
#define CPU_NVIC_ITNS2_ITNS_S                                                0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR0
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*0, `IAAMO the priority of interrupt number 4*0+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR0_PRI_N3_W                                               8
#define CPU_NVIC_IPR0_PRI_N3_M                                      0xFF000000
#define CPU_NVIC_IPR0_PRI_N3_S                                              24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*0, `IAAMO the priority of interrupt number 4*0+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR0_PRI_N2_W                                               8
#define CPU_NVIC_IPR0_PRI_N2_M                                      0x00FF0000
#define CPU_NVIC_IPR0_PRI_N2_S                                              16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*0, `IAAMO the priority of interrupt number 4*0+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR0_PRI_N1_W                                               8
#define CPU_NVIC_IPR0_PRI_N1_M                                      0x0000FF00
#define CPU_NVIC_IPR0_PRI_N1_S                                               8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*0, `IAAMO the priority of interrupt number 4*0+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR0_PRI_N0_W                                               8
#define CPU_NVIC_IPR0_PRI_N0_M                                      0x000000FF
#define CPU_NVIC_IPR0_PRI_N0_S                                               0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR1
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*1, `IAAMO the priority of interrupt number 4*1+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR1_PRI_N3_W                                               8
#define CPU_NVIC_IPR1_PRI_N3_M                                      0xFF000000
#define CPU_NVIC_IPR1_PRI_N3_S                                              24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*1, `IAAMO the priority of interrupt number 4*1+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR1_PRI_N2_W                                               8
#define CPU_NVIC_IPR1_PRI_N2_M                                      0x00FF0000
#define CPU_NVIC_IPR1_PRI_N2_S                                              16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*1, `IAAMO the priority of interrupt number 4*1+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR1_PRI_N1_W                                               8
#define CPU_NVIC_IPR1_PRI_N1_M                                      0x0000FF00
#define CPU_NVIC_IPR1_PRI_N1_S                                               8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*1, `IAAMO the priority of interrupt number 4*1+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR1_PRI_N0_W                                               8
#define CPU_NVIC_IPR1_PRI_N0_M                                      0x000000FF
#define CPU_NVIC_IPR1_PRI_N0_S                                               0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR2
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*2, `IAAMO the priority of interrupt number 4*2+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR2_PRI_N3_W                                               8
#define CPU_NVIC_IPR2_PRI_N3_M                                      0xFF000000
#define CPU_NVIC_IPR2_PRI_N3_S                                              24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*2, `IAAMO the priority of interrupt number 4*2+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR2_PRI_N2_W                                               8
#define CPU_NVIC_IPR2_PRI_N2_M                                      0x00FF0000
#define CPU_NVIC_IPR2_PRI_N2_S                                              16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*2, `IAAMO the priority of interrupt number 4*2+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR2_PRI_N1_W                                               8
#define CPU_NVIC_IPR2_PRI_N1_M                                      0x0000FF00
#define CPU_NVIC_IPR2_PRI_N1_S                                               8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*2, `IAAMO the priority of interrupt number 4*2+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR2_PRI_N0_W                                               8
#define CPU_NVIC_IPR2_PRI_N0_M                                      0x000000FF
#define CPU_NVIC_IPR2_PRI_N0_S                                               0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR3
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*3, `IAAMO the priority of interrupt number 4*3+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR3_PRI_N3_W                                               8
#define CPU_NVIC_IPR3_PRI_N3_M                                      0xFF000000
#define CPU_NVIC_IPR3_PRI_N3_S                                              24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*3, `IAAMO the priority of interrupt number 4*3+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR3_PRI_N2_W                                               8
#define CPU_NVIC_IPR3_PRI_N2_M                                      0x00FF0000
#define CPU_NVIC_IPR3_PRI_N2_S                                              16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*3, `IAAMO the priority of interrupt number 4*3+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR3_PRI_N1_W                                               8
#define CPU_NVIC_IPR3_PRI_N1_M                                      0x0000FF00
#define CPU_NVIC_IPR3_PRI_N1_S                                               8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*3, `IAAMO the priority of interrupt number 4*3+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR3_PRI_N0_W                                               8
#define CPU_NVIC_IPR3_PRI_N0_M                                      0x000000FF
#define CPU_NVIC_IPR3_PRI_N0_S                                               0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR4
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*4, `IAAMO the priority of interrupt number 4*4+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR4_PRI_N3_W                                               8
#define CPU_NVIC_IPR4_PRI_N3_M                                      0xFF000000
#define CPU_NVIC_IPR4_PRI_N3_S                                              24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*4, `IAAMO the priority of interrupt number 4*4+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR4_PRI_N2_W                                               8
#define CPU_NVIC_IPR4_PRI_N2_M                                      0x00FF0000
#define CPU_NVIC_IPR4_PRI_N2_S                                              16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*4, `IAAMO the priority of interrupt number 4*4+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR4_PRI_N1_W                                               8
#define CPU_NVIC_IPR4_PRI_N1_M                                      0x0000FF00
#define CPU_NVIC_IPR4_PRI_N1_S                                               8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*4, `IAAMO the priority of interrupt number 4*4+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR4_PRI_N0_W                                               8
#define CPU_NVIC_IPR4_PRI_N0_M                                      0x000000FF
#define CPU_NVIC_IPR4_PRI_N0_S                                               0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR5
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*5, `IAAMO the priority of interrupt number 4*5+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR5_PRI_N3_W                                               8
#define CPU_NVIC_IPR5_PRI_N3_M                                      0xFF000000
#define CPU_NVIC_IPR5_PRI_N3_S                                              24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*5, `IAAMO the priority of interrupt number 4*5+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR5_PRI_N2_W                                               8
#define CPU_NVIC_IPR5_PRI_N2_M                                      0x00FF0000
#define CPU_NVIC_IPR5_PRI_N2_S                                              16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*5, `IAAMO the priority of interrupt number 4*5+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR5_PRI_N1_W                                               8
#define CPU_NVIC_IPR5_PRI_N1_M                                      0x0000FF00
#define CPU_NVIC_IPR5_PRI_N1_S                                               8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*5, `IAAMO the priority of interrupt number 4*5+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR5_PRI_N0_W                                               8
#define CPU_NVIC_IPR5_PRI_N0_M                                      0x000000FF
#define CPU_NVIC_IPR5_PRI_N0_S                                               0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR6
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*6, `IAAMO the priority of interrupt number 4*6+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR6_PRI_N3_W                                               8
#define CPU_NVIC_IPR6_PRI_N3_M                                      0xFF000000
#define CPU_NVIC_IPR6_PRI_N3_S                                              24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*6, `IAAMO the priority of interrupt number 4*6+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR6_PRI_N2_W                                               8
#define CPU_NVIC_IPR6_PRI_N2_M                                      0x00FF0000
#define CPU_NVIC_IPR6_PRI_N2_S                                              16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*6, `IAAMO the priority of interrupt number 4*6+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR6_PRI_N1_W                                               8
#define CPU_NVIC_IPR6_PRI_N1_M                                      0x0000FF00
#define CPU_NVIC_IPR6_PRI_N1_S                                               8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*6, `IAAMO the priority of interrupt number 4*6+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR6_PRI_N0_W                                               8
#define CPU_NVIC_IPR6_PRI_N0_M                                      0x000000FF
#define CPU_NVIC_IPR6_PRI_N0_S                                               0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR7
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*7, `IAAMO the priority of interrupt number 4*7+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR7_PRI_N3_W                                               8
#define CPU_NVIC_IPR7_PRI_N3_M                                      0xFF000000
#define CPU_NVIC_IPR7_PRI_N3_S                                              24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*7, `IAAMO the priority of interrupt number 4*7+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR7_PRI_N2_W                                               8
#define CPU_NVIC_IPR7_PRI_N2_M                                      0x00FF0000
#define CPU_NVIC_IPR7_PRI_N2_S                                              16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*7, `IAAMO the priority of interrupt number 4*7+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR7_PRI_N1_W                                               8
#define CPU_NVIC_IPR7_PRI_N1_M                                      0x0000FF00
#define CPU_NVIC_IPR7_PRI_N1_S                                               8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*7, `IAAMO the priority of interrupt number 4*7+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR7_PRI_N0_W                                               8
#define CPU_NVIC_IPR7_PRI_N0_M                                      0x000000FF
#define CPU_NVIC_IPR7_PRI_N0_S                                               0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR8
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*8, `IAAMO the priority of interrupt number 4*8+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR8_PRI_N3_W                                               8
#define CPU_NVIC_IPR8_PRI_N3_M                                      0xFF000000
#define CPU_NVIC_IPR8_PRI_N3_S                                              24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*8, `IAAMO the priority of interrupt number 4*8+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR8_PRI_N2_W                                               8
#define CPU_NVIC_IPR8_PRI_N2_M                                      0x00FF0000
#define CPU_NVIC_IPR8_PRI_N2_S                                              16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*8, `IAAMO the priority of interrupt number 4*8+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR8_PRI_N1_W                                               8
#define CPU_NVIC_IPR8_PRI_N1_M                                      0x0000FF00
#define CPU_NVIC_IPR8_PRI_N1_S                                               8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*8, `IAAMO the priority of interrupt number 4*8+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR8_PRI_N0_W                                               8
#define CPU_NVIC_IPR8_PRI_N0_M                                      0x000000FF
#define CPU_NVIC_IPR8_PRI_N0_S                                               0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR9
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*9, `IAAMO the priority of interrupt number 4*9+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR9_PRI_N3_W                                               8
#define CPU_NVIC_IPR9_PRI_N3_M                                      0xFF000000
#define CPU_NVIC_IPR9_PRI_N3_S                                              24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*9, `IAAMO the priority of interrupt number 4*9+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR9_PRI_N2_W                                               8
#define CPU_NVIC_IPR9_PRI_N2_M                                      0x00FF0000
#define CPU_NVIC_IPR9_PRI_N2_S                                              16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*9, `IAAMO the priority of interrupt number 4*9+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR9_PRI_N1_W                                               8
#define CPU_NVIC_IPR9_PRI_N1_M                                      0x0000FF00
#define CPU_NVIC_IPR9_PRI_N1_S                                               8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*9, `IAAMO the priority of interrupt number 4*9+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR9_PRI_N0_W                                               8
#define CPU_NVIC_IPR9_PRI_N0_M                                      0x000000FF
#define CPU_NVIC_IPR9_PRI_N0_S                                               0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR10
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*10, `IAAMO the priority of interrupt number 4*10+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR10_PRI_N3_W                                              8
#define CPU_NVIC_IPR10_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR10_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*10, `IAAMO the priority of interrupt number 4*10+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR10_PRI_N2_W                                              8
#define CPU_NVIC_IPR10_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR10_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*10, `IAAMO the priority of interrupt number 4*10+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR10_PRI_N1_W                                              8
#define CPU_NVIC_IPR10_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR10_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*10, `IAAMO the priority of interrupt number 4*10+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR10_PRI_N0_W                                              8
#define CPU_NVIC_IPR10_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR10_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR11
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*11, `IAAMO the priority of interrupt number 4*11+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR11_PRI_N3_W                                              8
#define CPU_NVIC_IPR11_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR11_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*11, `IAAMO the priority of interrupt number 4*11+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR11_PRI_N2_W                                              8
#define CPU_NVIC_IPR11_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR11_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*11, `IAAMO the priority of interrupt number 4*11+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR11_PRI_N1_W                                              8
#define CPU_NVIC_IPR11_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR11_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*11, `IAAMO the priority of interrupt number 4*11+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR11_PRI_N0_W                                              8
#define CPU_NVIC_IPR11_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR11_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR12
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*12, `IAAMO the priority of interrupt number 4*12+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR12_PRI_N3_W                                              8
#define CPU_NVIC_IPR12_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR12_PRI_N3_S                                             24

