espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_nvic.h
// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*12, `IAAMO the priority of interrupt number 4*12+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR12_PRI_N2_W                                              8
#define CPU_NVIC_IPR12_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR12_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*12, `IAAMO the priority of interrupt number 4*12+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR12_PRI_N1_W                                              8
#define CPU_NVIC_IPR12_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR12_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*12, `IAAMO the priority of interrupt number 4*12+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR12_PRI_N0_W                                              8
#define CPU_NVIC_IPR12_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR12_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR13
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*13, `IAAMO the priority of interrupt number 4*13+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR13_PRI_N3_W                                              8
#define CPU_NVIC_IPR13_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR13_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*13, `IAAMO the priority of interrupt number 4*13+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR13_PRI_N2_W                                              8
#define CPU_NVIC_IPR13_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR13_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*13, `IAAMO the priority of interrupt number 4*13+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR13_PRI_N1_W                                              8
#define CPU_NVIC_IPR13_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR13_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*13, `IAAMO the priority of interrupt number 4*13+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR13_PRI_N0_W                                              8
#define CPU_NVIC_IPR13_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR13_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR14
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*14, `IAAMO the priority of interrupt number 4*14+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR14_PRI_N3_W                                              8
#define CPU_NVIC_IPR14_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR14_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*14, `IAAMO the priority of interrupt number 4*14+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR14_PRI_N2_W                                              8
#define CPU_NVIC_IPR14_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR14_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*14, `IAAMO the priority of interrupt number 4*14+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR14_PRI_N1_W                                              8
#define CPU_NVIC_IPR14_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR14_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*14, `IAAMO the priority of interrupt number 4*14+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR14_PRI_N0_W                                              8
#define CPU_NVIC_IPR14_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR14_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR15
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*15, `IAAMO the priority of interrupt number 4*15+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR15_PRI_N3_W                                              8
#define CPU_NVIC_IPR15_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR15_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*15, `IAAMO the priority of interrupt number 4*15+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR15_PRI_N2_W                                              8
#define CPU_NVIC_IPR15_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR15_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*15, `IAAMO the priority of interrupt number 4*15+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR15_PRI_N1_W                                              8
#define CPU_NVIC_IPR15_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR15_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*15, `IAAMO the priority of interrupt number 4*15+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR15_PRI_N0_W                                              8
#define CPU_NVIC_IPR15_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR15_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR16
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*16, `IAAMO the priority of interrupt number 4*16+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR16_PRI_N3_W                                              8
#define CPU_NVIC_IPR16_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR16_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*16, `IAAMO the priority of interrupt number 4*16+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR16_PRI_N2_W                                              8
#define CPU_NVIC_IPR16_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR16_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*16, `IAAMO the priority of interrupt number 4*16+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR16_PRI_N1_W                                              8
#define CPU_NVIC_IPR16_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR16_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*16, `IAAMO the priority of interrupt number 4*16+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR16_PRI_N0_W                                              8
#define CPU_NVIC_IPR16_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR16_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR17
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*17, `IAAMO the priority of interrupt number 4*17+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR17_PRI_N3_W                                              8
#define CPU_NVIC_IPR17_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR17_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*17, `IAAMO the priority of interrupt number 4*17+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR17_PRI_N2_W                                              8
#define CPU_NVIC_IPR17_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR17_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*17, `IAAMO the priority of interrupt number 4*17+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR17_PRI_N1_W                                              8
#define CPU_NVIC_IPR17_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR17_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*17, `IAAMO the priority of interrupt number 4*17+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR17_PRI_N0_W                                              8
#define CPU_NVIC_IPR17_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR17_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR18
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*18, `IAAMO the priority of interrupt number 4*18+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR18_PRI_N3_W                                              8
#define CPU_NVIC_IPR18_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR18_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*18, `IAAMO the priority of interrupt number 4*18+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR18_PRI_N2_W                                              8
#define CPU_NVIC_IPR18_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR18_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*18, `IAAMO the priority of interrupt number 4*18+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR18_PRI_N1_W                                              8
#define CPU_NVIC_IPR18_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR18_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*18, `IAAMO the priority of interrupt number 4*18+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR18_PRI_N0_W                                              8
#define CPU_NVIC_IPR18_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR18_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR19
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*19, `IAAMO the priority of interrupt number 4*19+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR19_PRI_N3_W                                              8
#define CPU_NVIC_IPR19_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR19_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*19, `IAAMO the priority of interrupt number 4*19+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR19_PRI_N2_W                                              8
#define CPU_NVIC_IPR19_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR19_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*19, `IAAMO the priority of interrupt number 4*19+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR19_PRI_N1_W                                              8
#define CPU_NVIC_IPR19_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR19_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*19, `IAAMO the priority of interrupt number 4*19+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR19_PRI_N0_W                                              8
#define CPU_NVIC_IPR19_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR19_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR20
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*20, `IAAMO the priority of interrupt number 4*20+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR20_PRI_N3_W                                              8
#define CPU_NVIC_IPR20_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR20_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*20, `IAAMO the priority of interrupt number 4*20+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR20_PRI_N2_W                                              8
#define CPU_NVIC_IPR20_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR20_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*20, `IAAMO the priority of interrupt number 4*20+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR20_PRI_N1_W                                              8
#define CPU_NVIC_IPR20_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR20_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*20, `IAAMO the priority of interrupt number 4*20+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR20_PRI_N0_W                                              8
#define CPU_NVIC_IPR20_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR20_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR21
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*21, `IAAMO the priority of interrupt number 4*21+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR21_PRI_N3_W                                              8
#define CPU_NVIC_IPR21_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR21_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*21, `IAAMO the priority of interrupt number 4*21+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR21_PRI_N2_W                                              8
#define CPU_NVIC_IPR21_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR21_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*21, `IAAMO the priority of interrupt number 4*21+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR21_PRI_N1_W                                              8
#define CPU_NVIC_IPR21_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR21_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*21, `IAAMO the priority of interrupt number 4*21+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR21_PRI_N0_W                                              8
#define CPU_NVIC_IPR21_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR21_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR22
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*22, `IAAMO the priority of interrupt number 4*22+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR22_PRI_N3_W                                              8
#define CPU_NVIC_IPR22_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR22_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*22, `IAAMO the priority of interrupt number 4*22+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR22_PRI_N2_W                                              8
#define CPU_NVIC_IPR22_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR22_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*22, `IAAMO the priority of interrupt number 4*22+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR22_PRI_N1_W                                              8
#define CPU_NVIC_IPR22_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR22_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*22, `IAAMO the priority of interrupt number 4*22+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR22_PRI_N0_W                                              8
#define CPU_NVIC_IPR22_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR22_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR23
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*23, `IAAMO the priority of interrupt number 4*23+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR23_PRI_N3_W                                              8
#define CPU_NVIC_IPR23_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR23_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*23, `IAAMO the priority of interrupt number 4*23+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR23_PRI_N2_W                                              8
#define CPU_NVIC_IPR23_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR23_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*23, `IAAMO the priority of interrupt number 4*23+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR23_PRI_N1_W                                              8
#define CPU_NVIC_IPR23_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR23_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*23, `IAAMO the priority of interrupt number 4*23+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR23_PRI_N0_W                                              8
#define CPU_NVIC_IPR23_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR23_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR24
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*24, `IAAMO the priority of interrupt number 4*24+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR24_PRI_N3_W                                              8
#define CPU_NVIC_IPR24_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR24_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*24, `IAAMO the priority of interrupt number 4*24+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR24_PRI_N2_W                                              8
#define CPU_NVIC_IPR24_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR24_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*24, `IAAMO the priority of interrupt number 4*24+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR24_PRI_N1_W                                              8
#define CPU_NVIC_IPR24_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR24_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*24, `IAAMO the priority of interrupt number 4*24+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR24_PRI_N0_W                                              8
#define CPU_NVIC_IPR24_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR24_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR25
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*25, `IAAMO the priority of interrupt number 4*25+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR25_PRI_N3_W                                              8
#define CPU_NVIC_IPR25_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR25_PRI_N3_S                                             24

