espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_nvic.h
// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*25, `IAAMO the priority of interrupt number 4*25+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR25_PRI_N2_W                                              8
#define CPU_NVIC_IPR25_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR25_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*25, `IAAMO the priority of interrupt number 4*25+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR25_PRI_N1_W                                              8
#define CPU_NVIC_IPR25_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR25_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*25, `IAAMO the priority of interrupt number 4*25+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR25_PRI_N0_W                                              8
#define CPU_NVIC_IPR25_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR25_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR26
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*26, `IAAMO the priority of interrupt number 4*26+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR26_PRI_N3_W                                              8
#define CPU_NVIC_IPR26_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR26_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*26, `IAAMO the priority of interrupt number 4*26+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR26_PRI_N2_W                                              8
#define CPU_NVIC_IPR26_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR26_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*26, `IAAMO the priority of interrupt number 4*26+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR26_PRI_N1_W                                              8
#define CPU_NVIC_IPR26_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR26_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*26, `IAAMO the priority of interrupt number 4*26+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR26_PRI_N0_W                                              8
#define CPU_NVIC_IPR26_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR26_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR27
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*27, `IAAMO the priority of interrupt number 4*27+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR27_PRI_N3_W                                              8
#define CPU_NVIC_IPR27_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR27_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*27, `IAAMO the priority of interrupt number 4*27+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR27_PRI_N2_W                                              8
#define CPU_NVIC_IPR27_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR27_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*27, `IAAMO the priority of interrupt number 4*27+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR27_PRI_N1_W                                              8
#define CPU_NVIC_IPR27_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR27_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*27, `IAAMO the priority of interrupt number 4*27+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR27_PRI_N0_W                                              8
#define CPU_NVIC_IPR27_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR27_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR28
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*28, `IAAMO the priority of interrupt number 4*28+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR28_PRI_N3_W                                              8
#define CPU_NVIC_IPR28_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR28_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*28, `IAAMO the priority of interrupt number 4*28+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR28_PRI_N2_W                                              8
#define CPU_NVIC_IPR28_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR28_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*28, `IAAMO the priority of interrupt number 4*28+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR28_PRI_N1_W                                              8
#define CPU_NVIC_IPR28_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR28_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*28, `IAAMO the priority of interrupt number 4*28+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR28_PRI_N0_W                                              8
#define CPU_NVIC_IPR28_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR28_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR29
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*29, `IAAMO the priority of interrupt number 4*29+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR29_PRI_N3_W                                              8
#define CPU_NVIC_IPR29_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR29_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*29, `IAAMO the priority of interrupt number 4*29+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR29_PRI_N2_W                                              8
#define CPU_NVIC_IPR29_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR29_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*29, `IAAMO the priority of interrupt number 4*29+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR29_PRI_N1_W                                              8
#define CPU_NVIC_IPR29_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR29_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*29, `IAAMO the priority of interrupt number 4*29+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR29_PRI_N0_W                                              8
#define CPU_NVIC_IPR29_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR29_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR30
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*30, `IAAMO the priority of interrupt number 4*30+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR30_PRI_N3_W                                              8
#define CPU_NVIC_IPR30_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR30_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*30, `IAAMO the priority of interrupt number 4*30+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR30_PRI_N2_W                                              8
#define CPU_NVIC_IPR30_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR30_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*30, `IAAMO the priority of interrupt number 4*30+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR30_PRI_N1_W                                              8
#define CPU_NVIC_IPR30_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR30_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*30, `IAAMO the priority of interrupt number 4*30+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR30_PRI_N0_W                                              8
#define CPU_NVIC_IPR30_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR30_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR31
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*31, `IAAMO the priority of interrupt number 4*31+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR31_PRI_N3_W                                              8
#define CPU_NVIC_IPR31_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR31_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*31, `IAAMO the priority of interrupt number 4*31+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR31_PRI_N2_W                                              8
#define CPU_NVIC_IPR31_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR31_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*31, `IAAMO the priority of interrupt number 4*31+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR31_PRI_N1_W                                              8
#define CPU_NVIC_IPR31_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR31_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*31, `IAAMO the priority of interrupt number 4*31+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR31_PRI_N0_W                                              8
#define CPU_NVIC_IPR31_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR31_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR32
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*32, `IAAMO the priority of interrupt number 4*32+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR32_PRI_N3_W                                              8
#define CPU_NVIC_IPR32_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR32_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*32, `IAAMO the priority of interrupt number 4*32+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR32_PRI_N2_W                                              8
#define CPU_NVIC_IPR32_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR32_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*32, `IAAMO the priority of interrupt number 4*32+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR32_PRI_N1_W                                              8
#define CPU_NVIC_IPR32_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR32_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*32, `IAAMO the priority of interrupt number 4*32+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR32_PRI_N0_W                                              8
#define CPU_NVIC_IPR32_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR32_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR33
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*33, `IAAMO the priority of interrupt number 4*33+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR33_PRI_N3_W                                              8
#define CPU_NVIC_IPR33_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR33_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*33, `IAAMO the priority of interrupt number 4*33+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR33_PRI_N2_W                                              8
#define CPU_NVIC_IPR33_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR33_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*33, `IAAMO the priority of interrupt number 4*33+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR33_PRI_N1_W                                              8
#define CPU_NVIC_IPR33_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR33_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*33, `IAAMO the priority of interrupt number 4*33+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR33_PRI_N0_W                                              8
#define CPU_NVIC_IPR33_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR33_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR34
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*34, `IAAMO the priority of interrupt number 4*34+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR34_PRI_N3_W                                              8
#define CPU_NVIC_IPR34_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR34_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*34, `IAAMO the priority of interrupt number 4*34+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR34_PRI_N2_W                                              8
#define CPU_NVIC_IPR34_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR34_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*34, `IAAMO the priority of interrupt number 4*34+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR34_PRI_N1_W                                              8
#define CPU_NVIC_IPR34_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR34_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*34, `IAAMO the priority of interrupt number 4*34+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR34_PRI_N0_W                                              8
#define CPU_NVIC_IPR34_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR34_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR35
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*35, `IAAMO the priority of interrupt number 4*35+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR35_PRI_N3_W                                              8
#define CPU_NVIC_IPR35_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR35_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*35, `IAAMO the priority of interrupt number 4*35+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR35_PRI_N2_W                                              8
#define CPU_NVIC_IPR35_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR35_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*35, `IAAMO the priority of interrupt number 4*35+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR35_PRI_N1_W                                              8
#define CPU_NVIC_IPR35_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR35_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*35, `IAAMO the priority of interrupt number 4*35+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR35_PRI_N0_W                                              8
#define CPU_NVIC_IPR35_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR35_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR36
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*36, `IAAMO the priority of interrupt number 4*36+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR36_PRI_N3_W                                              8
#define CPU_NVIC_IPR36_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR36_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*36, `IAAMO the priority of interrupt number 4*36+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR36_PRI_N2_W                                              8
#define CPU_NVIC_IPR36_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR36_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*36, `IAAMO the priority of interrupt number 4*36+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR36_PRI_N1_W                                              8
#define CPU_NVIC_IPR36_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR36_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*36, `IAAMO the priority of interrupt number 4*36+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR36_PRI_N0_W                                              8
#define CPU_NVIC_IPR36_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR36_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR37
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*37, `IAAMO the priority of interrupt number 4*37+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR37_PRI_N3_W                                              8
#define CPU_NVIC_IPR37_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR37_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*37, `IAAMO the priority of interrupt number 4*37+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR37_PRI_N2_W                                              8
#define CPU_NVIC_IPR37_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR37_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*37, `IAAMO the priority of interrupt number 4*37+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR37_PRI_N1_W                                              8
#define CPU_NVIC_IPR37_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR37_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*37, `IAAMO the priority of interrupt number 4*37+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR37_PRI_N0_W                                              8
#define CPU_NVIC_IPR37_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR37_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR38
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*38, `IAAMO the priority of interrupt number 4*38+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR38_PRI_N3_W                                              8
#define CPU_NVIC_IPR38_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR38_PRI_N3_S                                             24

