espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_nvic.h
// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*38, `IAAMO the priority of interrupt number 4*38+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR38_PRI_N2_W                                              8
#define CPU_NVIC_IPR38_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR38_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*38, `IAAMO the priority of interrupt number 4*38+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR38_PRI_N1_W                                              8
#define CPU_NVIC_IPR38_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR38_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*38, `IAAMO the priority of interrupt number 4*38+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR38_PRI_N0_W                                              8
#define CPU_NVIC_IPR38_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR38_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR39
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*39, `IAAMO the priority of interrupt number 4*39+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR39_PRI_N3_W                                              8
#define CPU_NVIC_IPR39_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR39_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*39, `IAAMO the priority of interrupt number 4*39+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR39_PRI_N2_W                                              8
#define CPU_NVIC_IPR39_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR39_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*39, `IAAMO the priority of interrupt number 4*39+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR39_PRI_N1_W                                              8
#define CPU_NVIC_IPR39_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR39_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*39, `IAAMO the priority of interrupt number 4*39+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR39_PRI_N0_W                                              8
#define CPU_NVIC_IPR39_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR39_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR40
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*40, `IAAMO the priority of interrupt number 4*40+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR40_PRI_N3_W                                              8
#define CPU_NVIC_IPR40_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR40_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*40, `IAAMO the priority of interrupt number 4*40+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR40_PRI_N2_W                                              8
#define CPU_NVIC_IPR40_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR40_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*40, `IAAMO the priority of interrupt number 4*40+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR40_PRI_N1_W                                              8
#define CPU_NVIC_IPR40_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR40_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*40, `IAAMO the priority of interrupt number 4*40+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR40_PRI_N0_W                                              8
#define CPU_NVIC_IPR40_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR40_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR41
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*41, `IAAMO the priority of interrupt number 4*41+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR41_PRI_N3_W                                              8
#define CPU_NVIC_IPR41_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR41_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*41, `IAAMO the priority of interrupt number 4*41+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR41_PRI_N2_W                                              8
#define CPU_NVIC_IPR41_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR41_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*41, `IAAMO the priority of interrupt number 4*41+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR41_PRI_N1_W                                              8
#define CPU_NVIC_IPR41_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR41_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*41, `IAAMO the priority of interrupt number 4*41+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR41_PRI_N0_W                                              8
#define CPU_NVIC_IPR41_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR41_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR42
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*42, `IAAMO the priority of interrupt number 4*42+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR42_PRI_N3_W                                              8
#define CPU_NVIC_IPR42_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR42_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*42, `IAAMO the priority of interrupt number 4*42+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR42_PRI_N2_W                                              8
#define CPU_NVIC_IPR42_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR42_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*42, `IAAMO the priority of interrupt number 4*42+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR42_PRI_N1_W                                              8
#define CPU_NVIC_IPR42_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR42_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*42, `IAAMO the priority of interrupt number 4*42+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR42_PRI_N0_W                                              8
#define CPU_NVIC_IPR42_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR42_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR43
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*43, `IAAMO the priority of interrupt number 4*43+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR43_PRI_N3_W                                              8
#define CPU_NVIC_IPR43_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR43_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*43, `IAAMO the priority of interrupt number 4*43+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR43_PRI_N2_W                                              8
#define CPU_NVIC_IPR43_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR43_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*43, `IAAMO the priority of interrupt number 4*43+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR43_PRI_N1_W                                              8
#define CPU_NVIC_IPR43_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR43_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*43, `IAAMO the priority of interrupt number 4*43+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR43_PRI_N0_W                                              8
#define CPU_NVIC_IPR43_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR43_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR44
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*44, `IAAMO the priority of interrupt number 4*44+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR44_PRI_N3_W                                              8
#define CPU_NVIC_IPR44_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR44_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*44, `IAAMO the priority of interrupt number 4*44+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR44_PRI_N2_W                                              8
#define CPU_NVIC_IPR44_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR44_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*44, `IAAMO the priority of interrupt number 4*44+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR44_PRI_N1_W                                              8
#define CPU_NVIC_IPR44_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR44_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*44, `IAAMO the priority of interrupt number 4*44+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR44_PRI_N0_W                                              8
#define CPU_NVIC_IPR44_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR44_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR45
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*45, `IAAMO the priority of interrupt number 4*45+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR45_PRI_N3_W                                              8
#define CPU_NVIC_IPR45_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR45_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*45, `IAAMO the priority of interrupt number 4*45+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR45_PRI_N2_W                                              8
#define CPU_NVIC_IPR45_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR45_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*45, `IAAMO the priority of interrupt number 4*45+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR45_PRI_N1_W                                              8
#define CPU_NVIC_IPR45_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR45_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*45, `IAAMO the priority of interrupt number 4*45+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR45_PRI_N0_W                                              8
#define CPU_NVIC_IPR45_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR45_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR46
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*46, `IAAMO the priority of interrupt number 4*46+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR46_PRI_N3_W                                              8
#define CPU_NVIC_IPR46_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR46_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*46, `IAAMO the priority of interrupt number 4*46+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR46_PRI_N2_W                                              8
#define CPU_NVIC_IPR46_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR46_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*46, `IAAMO the priority of interrupt number 4*46+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR46_PRI_N1_W                                              8
#define CPU_NVIC_IPR46_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR46_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*46, `IAAMO the priority of interrupt number 4*46+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR46_PRI_N0_W                                              8
#define CPU_NVIC_IPR46_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR46_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR47
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*47, `IAAMO the priority of interrupt number 4*47+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR47_PRI_N3_W                                              8
#define CPU_NVIC_IPR47_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR47_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*47, `IAAMO the priority of interrupt number 4*47+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR47_PRI_N2_W                                              8
#define CPU_NVIC_IPR47_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR47_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*47, `IAAMO the priority of interrupt number 4*47+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR47_PRI_N1_W                                              8
#define CPU_NVIC_IPR47_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR47_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*47, `IAAMO the priority of interrupt number 4*47+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR47_PRI_N0_W                                              8
#define CPU_NVIC_IPR47_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR47_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR48
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*48, `IAAMO the priority of interrupt number 4*48+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR48_PRI_N3_W                                              8
#define CPU_NVIC_IPR48_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR48_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*48, `IAAMO the priority of interrupt number 4*48+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR48_PRI_N2_W                                              8
#define CPU_NVIC_IPR48_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR48_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*48, `IAAMO the priority of interrupt number 4*48+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR48_PRI_N1_W                                              8
#define CPU_NVIC_IPR48_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR48_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*48, `IAAMO the priority of interrupt number 4*48+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR48_PRI_N0_W                                              8
#define CPU_NVIC_IPR48_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR48_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR49
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*49, `IAAMO the priority of interrupt number 4*49+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR49_PRI_N3_W                                              8
#define CPU_NVIC_IPR49_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR49_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*49, `IAAMO the priority of interrupt number 4*49+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR49_PRI_N2_W                                              8
#define CPU_NVIC_IPR49_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR49_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*49, `IAAMO the priority of interrupt number 4*49+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR49_PRI_N1_W                                              8
#define CPU_NVIC_IPR49_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR49_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*49, `IAAMO the priority of interrupt number 4*49+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR49_PRI_N0_W                                              8
#define CPU_NVIC_IPR49_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR49_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR50
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*50, `IAAMO the priority of interrupt number 4*50+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR50_PRI_N3_W                                              8
#define CPU_NVIC_IPR50_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR50_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*50, `IAAMO the priority of interrupt number 4*50+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR50_PRI_N2_W                                              8
#define CPU_NVIC_IPR50_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR50_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*50, `IAAMO the priority of interrupt number 4*50+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR50_PRI_N1_W                                              8
#define CPU_NVIC_IPR50_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR50_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*50, `IAAMO the priority of interrupt number 4*50+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR50_PRI_N0_W                                              8
#define CPU_NVIC_IPR50_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR50_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR51
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*51, `IAAMO the priority of interrupt number 4*51+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR51_PRI_N3_W                                              8
#define CPU_NVIC_IPR51_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR51_PRI_N3_S                                             24

