espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_nvic.h
// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*51, `IAAMO the priority of interrupt number 4*51+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR51_PRI_N2_W                                              8
#define CPU_NVIC_IPR51_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR51_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*51, `IAAMO the priority of interrupt number 4*51+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR51_PRI_N1_W                                              8
#define CPU_NVIC_IPR51_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR51_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*51, `IAAMO the priority of interrupt number 4*51+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR51_PRI_N0_W                                              8
#define CPU_NVIC_IPR51_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR51_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR52
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*52, `IAAMO the priority of interrupt number 4*52+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR52_PRI_N3_W                                              8
#define CPU_NVIC_IPR52_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR52_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*52, `IAAMO the priority of interrupt number 4*52+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR52_PRI_N2_W                                              8
#define CPU_NVIC_IPR52_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR52_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*52, `IAAMO the priority of interrupt number 4*52+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR52_PRI_N1_W                                              8
#define CPU_NVIC_IPR52_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR52_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*52, `IAAMO the priority of interrupt number 4*52+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR52_PRI_N0_W                                              8
#define CPU_NVIC_IPR52_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR52_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR53
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*53, `IAAMO the priority of interrupt number 4*53+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR53_PRI_N3_W                                              8
#define CPU_NVIC_IPR53_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR53_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*53, `IAAMO the priority of interrupt number 4*53+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR53_PRI_N2_W                                              8
#define CPU_NVIC_IPR53_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR53_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*53, `IAAMO the priority of interrupt number 4*53+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR53_PRI_N1_W                                              8
#define CPU_NVIC_IPR53_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR53_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*53, `IAAMO the priority of interrupt number 4*53+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR53_PRI_N0_W                                              8
#define CPU_NVIC_IPR53_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR53_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR54
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*54, `IAAMO the priority of interrupt number 4*54+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR54_PRI_N3_W                                              8
#define CPU_NVIC_IPR54_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR54_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*54, `IAAMO the priority of interrupt number 4*54+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR54_PRI_N2_W                                              8
#define CPU_NVIC_IPR54_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR54_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*54, `IAAMO the priority of interrupt number 4*54+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR54_PRI_N1_W                                              8
#define CPU_NVIC_IPR54_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR54_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*54, `IAAMO the priority of interrupt number 4*54+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR54_PRI_N0_W                                              8
#define CPU_NVIC_IPR54_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR54_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR55
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*55, `IAAMO the priority of interrupt number 4*55+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR55_PRI_N3_W                                              8
#define CPU_NVIC_IPR55_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR55_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*55, `IAAMO the priority of interrupt number 4*55+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR55_PRI_N2_W                                              8
#define CPU_NVIC_IPR55_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR55_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*55, `IAAMO the priority of interrupt number 4*55+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR55_PRI_N1_W                                              8
#define CPU_NVIC_IPR55_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR55_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*55, `IAAMO the priority of interrupt number 4*55+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR55_PRI_N0_W                                              8
#define CPU_NVIC_IPR55_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR55_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR56
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*56, `IAAMO the priority of interrupt number 4*56+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR56_PRI_N3_W                                              8
#define CPU_NVIC_IPR56_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR56_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*56, `IAAMO the priority of interrupt number 4*56+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR56_PRI_N2_W                                              8
#define CPU_NVIC_IPR56_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR56_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*56, `IAAMO the priority of interrupt number 4*56+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR56_PRI_N1_W                                              8
#define CPU_NVIC_IPR56_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR56_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*56, `IAAMO the priority of interrupt number 4*56+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR56_PRI_N0_W                                              8
#define CPU_NVIC_IPR56_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR56_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR57
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*57, `IAAMO the priority of interrupt number 4*57+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR57_PRI_N3_W                                              8
#define CPU_NVIC_IPR57_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR57_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*57, `IAAMO the priority of interrupt number 4*57+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR57_PRI_N2_W                                              8
#define CPU_NVIC_IPR57_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR57_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*57, `IAAMO the priority of interrupt number 4*57+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR57_PRI_N1_W                                              8
#define CPU_NVIC_IPR57_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR57_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*57, `IAAMO the priority of interrupt number 4*57+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR57_PRI_N0_W                                              8
#define CPU_NVIC_IPR57_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR57_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR58
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*58, `IAAMO the priority of interrupt number 4*58+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR58_PRI_N3_W                                              8
#define CPU_NVIC_IPR58_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR58_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*58, `IAAMO the priority of interrupt number 4*58+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR58_PRI_N2_W                                              8
#define CPU_NVIC_IPR58_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR58_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*58, `IAAMO the priority of interrupt number 4*58+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR58_PRI_N1_W                                              8
#define CPU_NVIC_IPR58_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR58_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*58, `IAAMO the priority of interrupt number 4*58+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR58_PRI_N0_W                                              8
#define CPU_NVIC_IPR58_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR58_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR59
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*59, `IAAMO the priority of interrupt number 4*59+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR59_PRI_N3_W                                              8
#define CPU_NVIC_IPR59_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR59_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*59, `IAAMO the priority of interrupt number 4*59+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR59_PRI_N2_W                                              8
#define CPU_NVIC_IPR59_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR59_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*59, `IAAMO the priority of interrupt number 4*59+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR59_PRI_N1_W                                              8
#define CPU_NVIC_IPR59_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR59_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*59, `IAAMO the priority of interrupt number 4*59+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR59_PRI_N0_W                                              8
#define CPU_NVIC_IPR59_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR59_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR60
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*60, `IAAMO the priority of interrupt number 4*60+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR60_PRI_N3_W                                              8
#define CPU_NVIC_IPR60_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR60_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*60, `IAAMO the priority of interrupt number 4*60+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR60_PRI_N2_W                                              8
#define CPU_NVIC_IPR60_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR60_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*60, `IAAMO the priority of interrupt number 4*60+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR60_PRI_N1_W                                              8
#define CPU_NVIC_IPR60_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR60_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*60, `IAAMO the priority of interrupt number 4*60+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR60_PRI_N0_W                                              8
#define CPU_NVIC_IPR60_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR60_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR61
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*61, `IAAMO the priority of interrupt number 4*61+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR61_PRI_N3_W                                              8
#define CPU_NVIC_IPR61_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR61_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*61, `IAAMO the priority of interrupt number 4*61+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR61_PRI_N2_W                                              8
#define CPU_NVIC_IPR61_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR61_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*61, `IAAMO the priority of interrupt number 4*61+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR61_PRI_N1_W                                              8
#define CPU_NVIC_IPR61_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR61_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*61, `IAAMO the priority of interrupt number 4*61+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR61_PRI_N0_W                                              8
#define CPU_NVIC_IPR61_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR61_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR62
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*62, `IAAMO the priority of interrupt number 4*62+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR62_PRI_N3_W                                              8
#define CPU_NVIC_IPR62_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR62_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*62, `IAAMO the priority of interrupt number 4*62+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR62_PRI_N2_W                                              8
#define CPU_NVIC_IPR62_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR62_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*62, `IAAMO the priority of interrupt number 4*62+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR62_PRI_N1_W                                              8
#define CPU_NVIC_IPR62_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR62_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*62, `IAAMO the priority of interrupt number 4*62+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR62_PRI_N0_W                                              8
#define CPU_NVIC_IPR62_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR62_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR63
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*63, `IAAMO the priority of interrupt number 4*63+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR63_PRI_N3_W                                              8
#define CPU_NVIC_IPR63_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR63_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*63, `IAAMO the priority of interrupt number 4*63+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR63_PRI_N2_W                                              8
#define CPU_NVIC_IPR63_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR63_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*63, `IAAMO the priority of interrupt number 4*63+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR63_PRI_N1_W                                              8
#define CPU_NVIC_IPR63_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR63_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*63, `IAAMO the priority of interrupt number 4*63+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR63_PRI_N0_W                                              8
#define CPU_NVIC_IPR63_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR63_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR64
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*64, `IAAMO the priority of interrupt number 4*64+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR64_PRI_N3_W                                              8
#define CPU_NVIC_IPR64_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR64_PRI_N3_S                                             24

