espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_nvic.h
// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*64, `IAAMO the priority of interrupt number 4*64+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR64_PRI_N2_W                                              8
#define CPU_NVIC_IPR64_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR64_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*64, `IAAMO the priority of interrupt number 4*64+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR64_PRI_N1_W                                              8
#define CPU_NVIC_IPR64_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR64_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*64, `IAAMO the priority of interrupt number 4*64+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR64_PRI_N0_W                                              8
#define CPU_NVIC_IPR64_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR64_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR65
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*65, `IAAMO the priority of interrupt number 4*65+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR65_PRI_N3_W                                              8
#define CPU_NVIC_IPR65_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR65_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*65, `IAAMO the priority of interrupt number 4*65+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR65_PRI_N2_W                                              8
#define CPU_NVIC_IPR65_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR65_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*65, `IAAMO the priority of interrupt number 4*65+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR65_PRI_N1_W                                              8
#define CPU_NVIC_IPR65_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR65_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*65, `IAAMO the priority of interrupt number 4*65+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR65_PRI_N0_W                                              8
#define CPU_NVIC_IPR65_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR65_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR66
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*66, `IAAMO the priority of interrupt number 4*66+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR66_PRI_N3_W                                              8
#define CPU_NVIC_IPR66_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR66_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*66, `IAAMO the priority of interrupt number 4*66+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR66_PRI_N2_W                                              8
#define CPU_NVIC_IPR66_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR66_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*66, `IAAMO the priority of interrupt number 4*66+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR66_PRI_N1_W                                              8
#define CPU_NVIC_IPR66_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR66_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*66, `IAAMO the priority of interrupt number 4*66+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR66_PRI_N0_W                                              8
#define CPU_NVIC_IPR66_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR66_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR67
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*67, `IAAMO the priority of interrupt number 4*67+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR67_PRI_N3_W                                              8
#define CPU_NVIC_IPR67_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR67_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*67, `IAAMO the priority of interrupt number 4*67+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR67_PRI_N2_W                                              8
#define CPU_NVIC_IPR67_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR67_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*67, `IAAMO the priority of interrupt number 4*67+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR67_PRI_N1_W                                              8
#define CPU_NVIC_IPR67_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR67_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*67, `IAAMO the priority of interrupt number 4*67+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR67_PRI_N0_W                                              8
#define CPU_NVIC_IPR67_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR67_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR68
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*68, `IAAMO the priority of interrupt number 4*68+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR68_PRI_N3_W                                              8
#define CPU_NVIC_IPR68_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR68_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*68, `IAAMO the priority of interrupt number 4*68+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR68_PRI_N2_W                                              8
#define CPU_NVIC_IPR68_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR68_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*68, `IAAMO the priority of interrupt number 4*68+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR68_PRI_N1_W                                              8
#define CPU_NVIC_IPR68_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR68_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*68, `IAAMO the priority of interrupt number 4*68+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR68_PRI_N0_W                                              8
#define CPU_NVIC_IPR68_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR68_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR69
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*69, `IAAMO the priority of interrupt number 4*69+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR69_PRI_N3_W                                              8
#define CPU_NVIC_IPR69_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR69_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*69, `IAAMO the priority of interrupt number 4*69+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR69_PRI_N2_W                                              8
#define CPU_NVIC_IPR69_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR69_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*69, `IAAMO the priority of interrupt number 4*69+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR69_PRI_N1_W                                              8
#define CPU_NVIC_IPR69_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR69_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*69, `IAAMO the priority of interrupt number 4*69+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR69_PRI_N0_W                                              8
#define CPU_NVIC_IPR69_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR69_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR70
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*70, `IAAMO the priority of interrupt number 4*70+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR70_PRI_N3_W                                              8
#define CPU_NVIC_IPR70_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR70_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*70, `IAAMO the priority of interrupt number 4*70+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR70_PRI_N2_W                                              8
#define CPU_NVIC_IPR70_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR70_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*70, `IAAMO the priority of interrupt number 4*70+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR70_PRI_N1_W                                              8
#define CPU_NVIC_IPR70_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR70_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*70, `IAAMO the priority of interrupt number 4*70+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR70_PRI_N0_W                                              8
#define CPU_NVIC_IPR70_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR70_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR71
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*71, `IAAMO the priority of interrupt number 4*71+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR71_PRI_N3_W                                              8
#define CPU_NVIC_IPR71_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR71_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*71, `IAAMO the priority of interrupt number 4*71+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR71_PRI_N2_W                                              8
#define CPU_NVIC_IPR71_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR71_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*71, `IAAMO the priority of interrupt number 4*71+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR71_PRI_N1_W                                              8
#define CPU_NVIC_IPR71_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR71_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*71, `IAAMO the priority of interrupt number 4*71+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR71_PRI_N0_W                                              8
#define CPU_NVIC_IPR71_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR71_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR72
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*72, `IAAMO the priority of interrupt number 4*72+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR72_PRI_N3_W                                              8
#define CPU_NVIC_IPR72_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR72_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*72, `IAAMO the priority of interrupt number 4*72+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR72_PRI_N2_W                                              8
#define CPU_NVIC_IPR72_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR72_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*72, `IAAMO the priority of interrupt number 4*72+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR72_PRI_N1_W                                              8
#define CPU_NVIC_IPR72_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR72_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*72, `IAAMO the priority of interrupt number 4*72+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR72_PRI_N0_W                                              8
#define CPU_NVIC_IPR72_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR72_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR73
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*73, `IAAMO the priority of interrupt number 4*73+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR73_PRI_N3_W                                              8
#define CPU_NVIC_IPR73_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR73_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*73, `IAAMO the priority of interrupt number 4*73+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR73_PRI_N2_W                                              8
#define CPU_NVIC_IPR73_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR73_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*73, `IAAMO the priority of interrupt number 4*73+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR73_PRI_N1_W                                              8
#define CPU_NVIC_IPR73_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR73_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*73, `IAAMO the priority of interrupt number 4*73+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR73_PRI_N0_W                                              8
#define CPU_NVIC_IPR73_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR73_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR74
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*74, `IAAMO the priority of interrupt number 4*74+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR74_PRI_N3_W                                              8
#define CPU_NVIC_IPR74_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR74_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*74, `IAAMO the priority of interrupt number 4*74+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR74_PRI_N2_W                                              8
#define CPU_NVIC_IPR74_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR74_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*74, `IAAMO the priority of interrupt number 4*74+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR74_PRI_N1_W                                              8
#define CPU_NVIC_IPR74_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR74_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*74, `IAAMO the priority of interrupt number 4*74+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR74_PRI_N0_W                                              8
#define CPU_NVIC_IPR74_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR74_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR75
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*75, `IAAMO the priority of interrupt number 4*75+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR75_PRI_N3_W                                              8
#define CPU_NVIC_IPR75_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR75_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*75, `IAAMO the priority of interrupt number 4*75+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR75_PRI_N2_W                                              8
#define CPU_NVIC_IPR75_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR75_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*75, `IAAMO the priority of interrupt number 4*75+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR75_PRI_N1_W                                              8
#define CPU_NVIC_IPR75_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR75_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*75, `IAAMO the priority of interrupt number 4*75+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR75_PRI_N0_W                                              8
#define CPU_NVIC_IPR75_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR75_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR76
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*76, `IAAMO the priority of interrupt number 4*76+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR76_PRI_N3_W                                              8
#define CPU_NVIC_IPR76_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR76_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*76, `IAAMO the priority of interrupt number 4*76+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR76_PRI_N2_W                                              8
#define CPU_NVIC_IPR76_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR76_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*76, `IAAMO the priority of interrupt number 4*76+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR76_PRI_N1_W                                              8
#define CPU_NVIC_IPR76_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR76_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*76, `IAAMO the priority of interrupt number 4*76+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR76_PRI_N0_W                                              8
#define CPU_NVIC_IPR76_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR76_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR77
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*77, `IAAMO the priority of interrupt number 4*77+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR77_PRI_N3_W                                              8
#define CPU_NVIC_IPR77_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR77_PRI_N3_S                                             24

