espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_nvic.h
// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*77, `IAAMO the priority of interrupt number 4*77+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR77_PRI_N2_W                                              8
#define CPU_NVIC_IPR77_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR77_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*77, `IAAMO the priority of interrupt number 4*77+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR77_PRI_N1_W                                              8
#define CPU_NVIC_IPR77_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR77_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*77, `IAAMO the priority of interrupt number 4*77+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR77_PRI_N0_W                                              8
#define CPU_NVIC_IPR77_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR77_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR78
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*78, `IAAMO the priority of interrupt number 4*78+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR78_PRI_N3_W                                              8
#define CPU_NVIC_IPR78_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR78_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*78, `IAAMO the priority of interrupt number 4*78+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR78_PRI_N2_W                                              8
#define CPU_NVIC_IPR78_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR78_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*78, `IAAMO the priority of interrupt number 4*78+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR78_PRI_N1_W                                              8
#define CPU_NVIC_IPR78_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR78_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*78, `IAAMO the priority of interrupt number 4*78+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR78_PRI_N0_W                                              8
#define CPU_NVIC_IPR78_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR78_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR79
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*79, `IAAMO the priority of interrupt number 4*79+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR79_PRI_N3_W                                              8
#define CPU_NVIC_IPR79_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR79_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*79, `IAAMO the priority of interrupt number 4*79+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR79_PRI_N2_W                                              8
#define CPU_NVIC_IPR79_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR79_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*79, `IAAMO the priority of interrupt number 4*79+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR79_PRI_N1_W                                              8
#define CPU_NVIC_IPR79_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR79_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*79, `IAAMO the priority of interrupt number 4*79+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR79_PRI_N0_W                                              8
#define CPU_NVIC_IPR79_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR79_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR80
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*80, `IAAMO the priority of interrupt number 4*80+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR80_PRI_N3_W                                              8
#define CPU_NVIC_IPR80_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR80_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*80, `IAAMO the priority of interrupt number 4*80+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR80_PRI_N2_W                                              8
#define CPU_NVIC_IPR80_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR80_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*80, `IAAMO the priority of interrupt number 4*80+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR80_PRI_N1_W                                              8
#define CPU_NVIC_IPR80_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR80_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*80, `IAAMO the priority of interrupt number 4*80+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR80_PRI_N0_W                                              8
#define CPU_NVIC_IPR80_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR80_PRI_N0_S                                              0

//*****************************************************************************
//
// Register: CPU_NVIC_O_IPR81
//
//*****************************************************************************
// Field: [31:24] PRI_N3
//
// For register NVIC_IPR*81, `IAAMO the priority of interrupt number 4*81+3, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR81_PRI_N3_W                                              8
#define CPU_NVIC_IPR81_PRI_N3_M                                     0xFF000000
#define CPU_NVIC_IPR81_PRI_N3_S                                             24

// Field: [23:16] PRI_N2
//
// For register NVIC_IPR*81, `IAAMO the priority of interrupt number 4*81+2, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR81_PRI_N2_W                                              8
#define CPU_NVIC_IPR81_PRI_N2_M                                     0x00FF0000
#define CPU_NVIC_IPR81_PRI_N2_S                                             16

// Field:  [15:8] PRI_N1
//
// For register NVIC_IPR*81, `IAAMO the priority of interrupt number 4*81+1, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR81_PRI_N1_W                                              8
#define CPU_NVIC_IPR81_PRI_N1_M                                     0x0000FF00
#define CPU_NVIC_IPR81_PRI_N1_S                                              8

// Field:   [7:0] PRI_N0
//
// For register NVIC_IPR*81, `IAAMO the priority of interrupt number 4*81+0, or
// is RES0 if the PE does not implement this interrupt
#define CPU_NVIC_IPR81_PRI_N0_W                                              8
#define CPU_NVIC_IPR81_PRI_N0_M                                     0x000000FF
#define CPU_NVIC_IPR81_PRI_N0_S                                              0


#endif // __CPU_NVIC__
